parciales-resueltos/gimnasio.md
```mermaid
%%{init: {
    "mirrorActors": false,
  "theme": "base",
  "themeVariables": {
    "background": "#0f1117",
    "actorBkg": "#1e2536",
    "actorBorder": "#4f8ef7",
    "actorTextColor": "#e2e8f0",
    "actorLineColor": "#2a3347",
    "signalColor": "#4f8ef7",
    "signalTextColor": "#e2e8f0",
    "labelBoxBkgColor": "#1e2536",
    "labelBoxBorderColor": "#2a3347",
    "labelTextColor": "#8899aa",
    "loopTextColor": "#8899aa",
    "noteBkgColor": "#1e2536",
    "noteBorderColor": "#a78bfa",
    "noteTextColor": "#e2e8f0",
    "activationBorderColor": "#4f8ef7",
    "activationBkgColor": "#2a3347"
  }
}}%%
sequenceDiagram
    title Caso de uso: Un socio con plan fan de las clases quiere reservar la sala de musculación pero ya llegó a su límite

    actor test as Test02

    create participant agenda as :AgendaGimnasio
    test ->> agenda: AgendaGimnasio()

    create participant gimnasio as :Gimnasio
    test ->> gimnasio: Gimnasio(agenda)

    create participant plan as plan:FanDeLasClases
    test ->> plan: PlanFanDeLasClases()

    create participant socio as socio:Socio
    test ->> socio: Socio(plan)

    test ->> gimnasio: agregarSocio(socio)

    test ->> socio: reservarSalaMusculacion()
    activate socio
    socio ->> plan: reservarSalaMusculacion(socio)
    activate plan
    plan ->> agenda: cuantasVecesReservadasASalaMusculacion(socio)
    activate agenda
    agenda -->> plan: 0
    deactivate agenda

    plan ->> plan: verificarMaximoDeReservasASalaMusculacion(0)
    activate plan
    deactivate plan
    plan ->> agenda: reservarSalaMusculacion(socio)
    deactivate plan
    deactivate socio

    test ->> socio: reservarSalaMusculacion()
    activate socio
    socio ->> plan: reservarSalaMusculacion(socio)
    activate plan
    plan ->> agenda: cuantasVecesReservadasASalaMusculacion(socio)
    activate agenda
    agenda -->> plan: 1
    deactivate agenda

    plan ->> plan: verificarMaximoDeReservasASalaMusculacion(1)
    activate plan
    deactivate plan
    plan ->> agenda: reservarSalaMusculacion(socio)
    deactivate plan
    deactivate socio

    test ->> socio: reservarSalaMusculacion()
    activate socio
    socio ->> plan: reservarSalaMusculacion(socio)
    activate plan
    plan ->> agenda: cuantasVecesReservadasASalaMusculacion(socio)
    activate agenda
    agenda -->> plan: 2
    deactivate agenda

    plan ->> plan: verificarMaximoDeReservasASalaMusculacion(2)
    activate plan
    create participant excepcion as :LimiteDeReservasAlcanzadoExcepcion
    plan ->> excepcion: LimiteDeReservasAlcanzadoExcepcion()
    deactivate plan
    deactivate plan

    deactivate socio
```
